update architecture pic
